## 한국 경마 2014년도 데이터

- 데이터셋 다운로드
    - https://www.kaggle.com/parksami/koreahorseracedata
    
- 컬럼 설명
    - RCHOSE_NM : 말이름
    - RANK : 등수

##### 데이터 로드
- 레이스 데이터, 말 데이터

In [15]:
df_race = pd.read_csv("2014_p.csv", encoding="euc-kr")
print(len(df_race))
df_race.tail(2)

27218

,ID,RCTRCK,RACE_DE,RACE_NO,PARTCPT_NO,RANK,RCHOSE_NM,HRSMN,RCORD,ARVL_DFFRNC,EACH_SCTN_PASAGE_RANK,A_WIN_SYTM_EXPECT_ALOT,WIN_STA_EXPECT_ALOT
27216,27217,제주,2014-11-29,9,7,6.0,미주여행,김경휴,0:01:31.1,13,2 - - - 2 - 3 - 6,6.2,9.4
27217,27218,제주,2014-11-29,9,6,1.0,철옹성,장우성,0:01:26.6,NaN,1 - - - 1 - 1 - 1,3.9,2.9

In [16]:
df_horse = pd.read_csv('2014_s.csv', encoding='euc-kr')
print(len(df_horse))
df_horse.tail(2)

27218

,ID,RCTRCK,RACE_DE,PRDCTN_NATION_NM,SEX,AGE,BND_WT,TRNER,RCHOSE_OWNR_NM,RCHOSE_BDWGH
27216,27217,제주,2014-11-29,한,거,NaN,53.0,강대은,김기준,281
27217,27218,제주,2014-11-29,한,거,NaN,57.5,박병진,강상우,314

### Quiz 1
- 1등을 가장 많이 한 말의 이름과 우승횟수를 출력하세요.

In [17]:
df_race[df_race["RANK"] == 1].tail()
df_rank_1 = df_race[df_race["RANK"] == 1].groupby("RCHOSE_NM").size().reset_index(name="count")
df_rank_1 = df_rank_1[df_rank_1["count"] == df_rank_1["count"].max()]
df_rank_1["count"].max(), list(df_rank_1["RCHOSE_NM"])

(7, ['가리사니', '한강의기적'])

### Quiz 2

- 말의 순위를 아래와 같이 승점제로 했을때 1등 부터 5등까지 말의 이름과 승점을 출력하세요.
    - 1등 3점
    - 2등 2점
    - 3등 1점

In [18]:
df_merged = pd.merge(df_race, df_horse)
df_merged["POINT"] = df_merged["RANK"].apply(lambda rank: 4 - rank if rank <= 3 else 0)
df = df_merged[["RCHOSE_NM", "POINT"]]
df = df.groupby("RCHOSE_NM").agg("sum").reset_index()
df = df.sort_values("POINT", ascending=False)
df.reset_index(drop=True, inplace=True)
df.head()

  RCHOSE_NM  POINT
0      신천보스   25.0
1     금포스카이   24.0
2     한강의기적   23.0
3      가리사니   23.0
4      신천돌채   22.0

### Quiz 3
- 성별에 따른 말의 성적을 데이터 프레임으로 출력하세요.
- 아래와 같이 3가지 성별에 따른 1등부터 5등까지의 랭킹 데이터를 확률 데이터로 출력하세요.
- 랭킹1등의 수컷의 10.81의 수치는 (1등한 수컷말의 횟수 / 전체 수컷말의 레이스 참가 횟수 ) 입니다.
    - 수컷 말중에 레이스에 참가한 횟수가 10000번이라 10000번의 레이스중에 1등을 1081번했다는 뜻입니다.

In [19]:
df_merged = pd.merge(df_race, df_horse)
df_merged["COUNT"] = 1
df = df_merged.pivot_table("COUNT", "RANK", "SEX", aggfunc=np.sum)
count = df_merged.groupby("SEX").size()
df = df / count * 100
df = round(df, 2)
df.head()

SEX      거      수     암
RANK
1.0   9.47  10.81  8.19
2.0   8.75  10.47  8.67
3.0   9.65   9.97  8.74
4.0   9.40   9.60  9.19
5.0   9.00   9.09  9.75